tests/performance-test.yml
config:
  target: 'http://192.168.0.4:3000' # Target server with the trajectory API
  phases:
    - duration: 120 # test duration
      arrivalRate: 20 # Number of requests every second
  processor: "./request-builder.js"
scenarios:
  - name: "Mean API test"
    weight: 50 # Average 50% of users
    flow: 
    - post:
        url: "/trajectory/mean"
        beforeRequest: setJSONBody
  - name: "Median API test"
    weight: 50 # Average 50% of users
    flow: 
    - post:
        url: "/trajectory/median"
        beforeRequest: setJSONBody